

let theEditor;
function FullCkEditor(id) {
    DecoupledEditor
        .create(document.querySelector('#' + id))
        .then(editor => {
            theEditor = editor;
            const toolbarContainer = document.querySelector('#toolbar-container');
            toolbarContainer.appendChild(editor.ui.view.toolbar.element);
        })
        .catch(error => {
            console.error(error);
        });
}

const dataStory = [
    //{
    //    id: 0,
    //    title: 'پیش خرید/خرید',
    //    image: '../Img/Story/1.png',
    //    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت م'
    //},
    //{
    //    id: 1,
    //    title: 'مشارکت یا فروش',
    //    image: '../Img/Story/3.png',
    //    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت م'
    //},
    //{
    //    id: 2,
    //    title: 'معاوضه ملکی',
    //    image: '../Img/Story/4.png',
    //    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت م'
    //},
    //{
    //    id: 3,
    //    title: 'معاوضه غیر ملکی',
    //    image: '../Img/Story/2.png',
    //    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت م'
    //},
    //{
    //    id: 4,
    //    title: 'همکاری',
    //    image: '../Img/Story/5.png',
    //    description: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت م'
    //},


]
const data = [


]
dataStory.map(item => {
    $("#pardisan-story").append(
        `<div class="item-story " id='item-story' data-id='${item.id}'>
     <div clsss='circle-story-content'>
    <img class="circle-story img-fluid" src="${item.image}">
    </div>
    <div>
    <span class='text-circle-story'>${item.title}</span>
    </div>
 </div>

        `
    )
})
$(document).ready(function () {
    $("#pardisan-story").on("click", "#item-story", function () {
        var id = $(this).data("id");

        $.magnificPopup.open({
            key: 'my-popup',
            items: data,
            type: 'inline',

            gallery: {
                enabled: true
            },

        }, id);
    });
    $('.upsert-request-btn').on('click', () => {
        $('.drawer-request').css({
            "left": "0"
        })
    })
    $('.close-drawer-request').on('click', () => {
        $('.drawer-request').css({
            "left": "-100%"
        })
    })
})

